<?php

$judy=[95,64,70,90,84];
$amo=[88,78,54,81,71];
$john=[88,78,54,81,71];
$peter=[88,78,54,81,71];
$hebe=[88,78,54,81,71];


$score=[
    "judy"=>[
        "國文"=>95,
        "英文"=>64,
        "數學"=>70,
        "地理"=>90,
        "歷史"=>84
    ],
    "amo"=>[
        "國文"=>88,
        "英文"=>78,
        "數學"=>54,
        "地理"=>81,
        "歷史"=>71
    ],
    "john"=>[
        "國文"=>55,
        "英文"=>78,
        "數學"=>68,
        "地理"=>70,
        "歷史"=>62
    ],
    "peter"=>[
        "國文"=>60,
        "英文"=>88,
        "數學"=>77,
        "地理"=>54,
        "歷史"=>42
    ],
    "hebe"=>[
        "國文"=>99,
        "英文"=>100,
        "數學"=>80,
        "地理"=>62,
        "歷史"=>64
    ]
];

echo "<pre>";print_r($score);echo "</pre>";

?>

<h4>陣列練習-99乘法表</h4>
<hr>

<?php 

$a[0]="1*1=1";
$a[1]="1*2=2";
$a[2]="1*3=3";
$a[81]="9*9=81";

$a=[];
for ($i = 1; $i <= 9; $i++){
    for ($j = 1; $j <= 9; $j++){
        $a[] = $i . " x " .$j . " = " . ($i*$j);
    }
}
echo "<pre>";print_r($a);echo "</pre>";

/*

$a[0] = "1 x 1 = 1";
$a[1] = "1 x 2 = 2";
.
.
.
$a[80] = "9 x 9 = 81";
*/ 

//除了用"echo "<pre>";print_r($a);echo "</pre>";  用迴圈列印$a的陣列結果

for ($i = 0; $i < count($a); $i++){
    echo $a[$i] . " , ";
        if ( $i % 9 == 8 ){
            echo "<br>";
        }

}

echo "============="."<br>";

foreach ($a as $key => $d){
    echo $d . "<br>" ;
        if ($key % 9 == 8){
            echo "<br>";
        }
}

//foreach一定會遍歷所有陣列裡面的值



?>