<h4>天干地支年別</h4>
<p>已知西元1024為甲子年,提供一個西元年份,輸出天干地支</p>
<p>天干：甲乙丙丁戊己更辛壬癸</p>
<p>地支：子丑寅卯辰巳午未申酉戌亥</p>
<?php 

/*
        1024  1025   1026  .....  1035  1036  
        甲     乙      丙  .....   甲     乙
        子     丑      寅  .....   戌     亥
sky[]   0      1       2           0      1
land[]  0      1       2           0      1
*/ 


$start = 1024;
$sky = ["甲", "乙", "丙", "丁", "戊", "己", "更", "辛", "壬", "癸",];
$land = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥", ];

$year = 2020;
$arr = [];

for($i = 1024; $i < 3000; $i++){
    $arr[$i] = $sky[ ($i % 10 +6) % 10 ]. $land[ ($i % 12 +8) %12 ];
}

// echo "<pre>";print_r($arr);echo "</pre>";

echo $year . "是" . $arr[$year] . "年";


?>

<hr>
<h4>天干地支年別2</h4>

<?php 


$start = 1024;
$sky = [ "庚", "辛", "壬", "癸","甲", "乙", "丙", "丁", "戊", "己",];
$land = ["申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未"];

$year = 2020;
$arr = [];
for($i = 1024; $i < 3000; $i++){
    $arr[$i] = $sky[ ($i % 10) ]. $land[ ($i % 12 ) ];
}
// $sky要取0~9的值 用i值除10取餘數就會得到尾數
// echo "<pre>";print_r($arr);echo "</pre>";
echo $year . "是" . $arr[$year] . "年";





?>

